{
  "contact": {
    "linkedin": "https://www.linkedin.com/in/richard-booth-480677119/",
    "github": "https://github.com/Rixcy",
    "email": "hello@rickbooth.me"
  },
  "jobs": [
    {
      "title": "Web Developer",
      "company": "Awaze UK",
      "company_website": "https://awaze.co.uk/",
      "role": "I’m currently working as a web developer for Awaze UK. Working here I get exposure to over 20 brands, working on minor changes to full page overhauls. Recently I built a proof of concept React monorepo to provide the team with simple, modular, component based development using new technologies. <br/><br/>This involved setting up Storybook to provide visual guides to components, writing simple Jest tests including setting up snapshots and setting up a build process to treat each component individually for exporting as a library.",
      "time_in_role": "July 2019 - Present",
      "skills": [
        "React",
        "Webpack/Babel/Rollup",
        "Javascript/ES6",
        "HTML5/CSS3"
      ]
    },
    {
      "title": "Web Developer",
      "company": "Lead Tech",
      "company_website": "https://lead-tech.co.uk/",
      "role": "I previously worked as a web developer for Lead Tech. Part of my role here involved me implementing a new technology stack for the team, moving away from using Jekyll to using VueJS for new projects. <br/><br/>These projects included building their main website, building landing pages and building a blog; focusing on increasing page speeds and making it quicker/easier to add further functionality with Vue’s powerful toolkit. <br/><br/>I also mentored a graduate developer during my time here, helping them learn technologies like Vue, TailwindCSS and ES6.",
      "time_in_role": "October 2018 - July 2019",
      "skills": [
        "VueJS",
        "Sass",
        "Javascript/ES6",
        "Nuxt",
        "AWS"
      ]
    },
    {
      "title": "Software Developer",
      "company": "CPOMS",
      "company_website": "https://www.cpoms.co.uk/",
      "role": "After working on several smaller projects I moved on to software development full time. Working in a small development team on a rapidly growing Ruby on Rails product. I worked on several interesting features and brought both internal and customer-based suggestions to life.",
      "time_in_role": "December 2016 - October 2018",
      "skills": [
        "Ruby on Rails",
        "Sass",
        "Javascript/jQuery",
        "MySQL"
      ]
    },
    {
      "title": "2nd Line Support Technician",
      "company": "Meritec Ltd",
      "company_website": "https://www.meritec.co.uk/",
      "role": "Alongside the day to day role of providing technical support to schools trying to establish a data connection between their servers and ours, I also worked on several development projects such as implementing an online booking system, an internal documentation server with a built in CMS and WYSIWYG editor.<br/><br/>I focused improving the speed and SEO optimisation for the company website using techniques such as minifying files, compressing images and prioritising above-the-fold content.",
      "time_in_role": "September 2015 - December 2016",
      "skills": [
        "IT Support",
        "MIS (Management Information System) Support",
        "Windows Server Remote Support",
        "Mentoring Apprentices"
      ]
    },
    {
      "title": "Analytical Chemist",
      "company": "Keighley Laboratories",
      "company_website": "https://www.keighleylabs.co.uk/",
      "role": "As a first job, I worked with ferrous and non-ferrous metals to determine their chemical compositions using various different wet chemistry methods.<br><br> I discovered my passion for IT in this role by managing the company's CMS and by helping improve general IT procedures such as creating an interactive spreadsheet for calculating the uncertainty of measurement with equipment and techniques.",
      "time_in_role": "September 2012 - September 2015",
      "skills": [
        "Atomic Absorption Spectroscopy",
        "Inductively Coupled Plasma Mass Spectrometry",
        "Titration",
        "Distillation"
      ]
    }
  ]
}
